"""
자료구조

"""

'''

1. 자료구조가 필요한 이유?
- 데이터를 효율적으로 저장, 관리하여 메모리를 효율적으로 사용하기 위함
- 적정한 자료구조의 사용은 메모리의 용량을 절약 - > 실행시간의 단축

[현실적인 필요 이유]
-알고리즘을 위한 기초지식
-효율적인 메모리 사용 (클린코딩)

'''

'''
2. 알고리즘
- 일을 효율적으로 처리하기 위한 절차
- 어떠한 일을 처리하는 절차 및 순서


'''

'''
문제) 아침에 침대에서 일어난 뒤 냉장고에 있는 우유를 이용해
컵 받침대에 있는 새로운 컵으로 그 우유를 마시는 순서

1. 침대에서 일어난다
-침구를 정리한 뒤 냉장고 앞으로 간다
-냉장고 문을 열어서 우유를 꺼낸다.
-꺼낸 우유를 컵 받침대에 있는 새로운 컵에 담는다.
end. 컵을 들어서 컵에 있는 우유를 마신다

*자료구조는 컵을 생각해보면 된다!
-- 그럼 컵의 크기가 커지거나 작아지면 어떻게 되나?
 > 컵이 커지면 커질수록 우유를 많이 따라서 마셔야 한다
  -> 배가 부를수 있다.
  적절한 컵의 사용이 중요!
  -> 다른 컵을 사용한다고 못 마시는 건 아니다!

'''

'''
3. 자료 구조의 종류
[자료구조의 종류]
-- 선형 구조
  ㄴ 배열
  ㄴ 링크드 리스트
  ㄴ 스택
  ㄴ 큐
-- 비선형 구조
   ㄴ 트리  
   ㄴ 그래프

파이썬에서의 자료구조 종류
-튜플
-리스트
-딕셔너리
-세트

'''